In [1]:
import csv
import pandas as pd

In [4]:
long = pd.read_csv("/Users/sophie/Desktop/UWash/Data 557/Data557_GroupProject_CapeTown/Code/Question2/promoted_faculty_longitudinal.csv")
long.head()

,case,id,sex,deg,yrdeg,field,startyr,year,rank,admin,salary,first_associate_year,promotion_year
0,40,10,M,PhD,68,Arts,80,80,Assoc,0,3250.0,80,93
1,41,10,M,PhD,68,Arts,80,81,Assoc,0,3671.0,80,93
2,42,10,M,PhD,68,Arts,80,82,Assoc,0,3831.0,80,93
3,43,10,M,PhD,68,Arts,80,83,Assoc,0,4042.0,80,93
4,44,10,M,PhD,68,Arts,80,84,Assoc,0,4317.0,80,93

In [5]:
summ = pd.read_csv("/Users/sophie/Desktop/UWash/Data 557/Data557_GroupProject_CapeTown/Code/Question2/promoted_faculty_summary.csv")
summ.head()

,id,sex,deg,yrdeg,field,startyr,first_associate_year,ever_promoted,associate_cohort_bin,assoc_year_centered,promotion_year
0,10,M,PhD,68,Arts,80,80,1,"(75, 80]",-4.300813,93
1,13,M,PhD,68,Prof,69,76,1,"(75, 80]",-8.300813,82
2,14,M,PhD,79,Other,92,92,1,"(90, 95]",7.699187,94
3,16,M,PhD,73,Other,79,82,1,"(80, 85]",-2.300813,89
4,17,M,PhD,72,Other,72,77,1,"(75, 80]",-7.300813,83

In [6]:
event = pd.read_csv("/Users/sophie/Desktop/UWash/Data 557/Data557_GroupProject_CapeTown/Code/Question2/promotion_event_dataset.csv")
event

,id,sex,deg,yrdeg,field,startyr,first_associate_year,ever_promoted,associate_cohort_bin,assoc_year_centered,promotion_year,associate_year_before_promotion,salary_before_promotion,salary_at_promotion,salary_change_at_promotion
0,10,M,PhD,68,Arts,80,80,1,"(75, 80]",-4.300813,93,92.0,6781.0,7180.0,399.0
1,13,M,PhD,68,Prof,69,76,1,"(75, 80]",-8.300813,82,79.0,2540.0,3322.0,782.0
2,14,M,PhD,79,Other,92,92,1,"(90, 95]",7.699187,94,93.0,8770.0,9025.0,255.0
3,16,M,PhD,73,Other,79,82,1,"(80, 85]",-2.300813,89,88.0,4538.0,5290.0,752.0
4,17,M,PhD,72,Other,72,77,1,"(75, 80]",-7.300813,83,NaN,NaN,2994.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
542,1757,F,Other,69,Other,82,82,1,"(80, 85]",-2.300813,87,86.0,3799.0,4105.0,306.0
543,1764,M,Other,71,Other,77,84,1,"(80, 85]",-0.300813,87,86.0,3487.0,4105.0,618.0
544,1765,M,Other,55,Arts,68,76,1,"(75, 80]",-8.300813,81,NaN,NaN,2797.5,NaN
545,1766,M,Other,55,Arts,68,76,1,"(75, 80]",-8.300813,78,77.0,2216.0,2256.0,40.0
546,1770,M,Other,51,Other,64,76,1,"(75, 80]",-8.300813,82,NaN,NaN,3322.0,NaN

In [7]:
df = pd.read_csv("/Users/sophie/Desktop/UWash/Data 557/Data557_GroupProject_CapeTown/Code/Question2/promoted_faculty_dataset.csv")
df.head()

,id,sex,deg,yrdeg,field,startyr,first_associate_year,ever_promoted,associate_cohort_bin,assoc_year_centered,promotion_year,salary_at_promotion
0,10,M,PhD,68,Arts,80,80,1,"(75, 80]",-4.300813,93,7180.0
1,13,M,PhD,68,Prof,69,76,1,"(75, 80]",-8.300813,82,3322.0
2,14,M,PhD,79,Other,92,92,1,"(90, 95]",7.699187,94,9025.0
3,16,M,PhD,73,Other,79,82,1,"(80, 85]",-2.300813,89,5290.0
4,17,M,PhD,72,Other,72,77,1,"(75, 80]",-7.300813,83,2994.0